# Задание №1
# Ранее вы выполняли задание связанное с ветеринарной клиникой. 
# В той задаче вам предстояло вывести информацию о питомце на экран. 
# Сейчас вам необходимо создать словарь pets = {}
# Примерный вид будет следующим:
# pets = {
#   "Имя питомца": {
#     'Вид питомца': # придумайте каким образом сюда внести информацию,
#     'Возраст питомца': # придумайте каким образом сюда внести информацию,
#     'Имя владельца': # придумайте каким образом сюда внести информацию
#   }
# }
# У вас должен получиться словарь, с ещё одним словарём внутри. 
# То есть, есть словарь pets. Он в себе хранит ещё один словарь, который обозначается именем питомца. 
# Имя питомца также нужно каким-то образом вносить туда.
# Задача не будет считаться выполненной, если вы заходите сразу внести информацию, не прибегая в функции input()
# Например: 
# pets = {
#   "Мухтар": {
#     "Вид питомца": "Собака",
#     "Возраст питомца": 9,
#     "Имя владельца": "Павел" 
#   }
# }
# Так должен будет выглядеть результируюший словарь, но первоначальный его вид - пустой. 
# Его необходимо заполнить пользовательским вводом через консоль с помощью функции input(), а не вписать значения уже в самом коде.
# Возраст питомца должен быть типа int Всё остальное - строки
# Так как возраст питомца указывается типом int. 
# Необходимо, в соответствии с указанным возрастом выводит год, года или лет. Например:
# Его возраст: 24 года 
# Его возраст: 21 год 
# Его возраст: 19 лет 
# И теперь осталось только получить всю информацию о питомце в виде строки, как из задания по Урок №3. 
# Ввод-вывод и базовые переменные. Задание №1, но с небольшими изменениями. 
# Для получения информации необходимо воспользоваться методами словаря keys() и values():  
# Это желторотый питон по кличке "Каа". Возраст питомца: 19 лет. Имя владельца: Саша

pets = {}
NamePet = str(input("Введите имя питомца: "))
TypePet = str(input("Введите вид питомца: "))
AgePet = int(input("Введите возраст питомца: "))
NameOwner = str(input("Введите имя владельца питомца: "))
pets[NamePet] = {
    "Вид питомца": TypePet,
    "Возраст питомца": AgePet,
    "Имя владельца": NameOwner
}
Age = pets[NamePet]["Возраст питомца"]
if Age % 10 == 1 and Age % 100 != 11:
    Okn = "год"
elif 2 <= Age % 10 <= 4 and not (12 <= Age % 100 <= 14):
    Okn = "года"
else:
    Okn = "лет"
Dan = pets[NamePet]
PetNameDict = list(pets.keys())[0] 
ValueList = list(Dan.values())
TypeVal = ValueList[0].lower()
AgeVal = ValueList[1]
OwnVal = ValueList[2]
print(f'Это {TypeVal} по кличке "{PetNameDict}". Возраст питомца: {AgeVal} {Okn}. Имя владельца: {OwnVal}.')