# Задание №3
# На берегу реки стояли n рыбаков, все они хотели перебраться на другой берег. 
# Одна лодка может выдержать не более m килограмм, при этом в лодку помещается не более 2 человек. 
# Определите, какое минимальное число лодок нужно, чтобы перевезти на другой берег всех рыбаков. 
# В первую строку вводится число m (1 ≤ m ≤ 10e6) - максимальная масса, которую может выдержать одна лодка. 
# Во вторую строку вводится число n (1 ≤ n ≤ 100) - количество рыбаков. 
# В следующие N строк вводится по одному числу Ai (1 ≤ Ai ≤ m) - вес каждого путешественника. 
# Программа должна вывести одно число - минимальное количество лодок, 
# необходимое для переправки всех рыбаков на противоположный берег.
Massa = int(input("Введите максимальную массу, которая может выдержать одна лодка: "))
Kol = int(input("Введите количество рыбаков: "))
VObsh = []
print("Введите в каждую строку вес одного рыбака:")
for i in range(Kol):
    Ves = int(input())
    VObsh.append(Ves)
VObsh.sort()
Lodka = 0
while len(VObsh) > 0:
    if len(VObsh) == 1:
        Lodka += 1
        VObsh.pop(0)
    else:
        if VObsh[0] + VObsh[-1] <= Massa:
            VObsh.pop(0)
            VObsh.pop(-1)
        else:
            VObsh.pop(-1)
        Lodka += 1
print("Необходимо количество лодок:", Lodka)