# Задание №2
# В первую строчку вводится число N (1 ≤ N ≤ 100 000). 
# В следующую строку через пробел вводятся N чисел (1 ≤ Ai ≤ 10e9). 
# Вам требуется написать метод, который получает на вход массив и изменяет его таким образом, 
# чтобы на первом месте стоял последний элемент, на втором - первый, на третьем - второй и т. д. 
# Выведите N чисел - измененный массив.
# 1. Считываем количество элементов (хотя в Python для этого решения N даже не пригодится)
N = int(input())
res = list(map(int, input().split()))
Posledniy = res.pop()
res.insert(0, Posledniy)
print(res)