# Задание №1
# Давай представим, что мы пишем бэкенд для сайта ветеринарной клиники. 
# Нам нужно написать программу, которая будет запрашивать у пользователя вид питомца, его возраст и кличку, 
# а потом выведет все эти данные в одно предложение. Например:
# Это желторотый питон по кличке "Каа". Возраст: 34 года.

a = input("Введите вид питомца: ")
b = input("Введите кличку питомца: ")
c = input("Введите возраст питомца: ")
print("Это " + a + " по кличке " + '"' + b + '"' + ". Возраст: " + c + " года.")